//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий для вызова окна диалога.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  

   //Функция вызова окна диалога. 
  
   function CallDialog() {
   
    //Вызвать окно диалога.	
    var p = showModalDialog("jspage/dialog.html", ["5", "x", "y", "z"],"dialogwidth:400; dialogheight:300; resizable: yes");
                                          
    
     //Вывести сообщение с результатом. 
     alert("Возвращенное значение из диалога: "+p);       
   }
//---------------------------------------------------------------------------------------  
