//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий для вызова окон оповещения.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  

   //Функция вызова окна Alert. 
  
   function CallAlert() {
   
    var p = 155;
         
     alert("Функцию alert() удобно использовать при отладке сценариев.С ее помощью можно"+ 
           " вывести на экран любую пременную из сценария, например: p= "+p);       
   }
//---------------------------------------------------------------------------------------

  
   //Функция вызова окна Prompt. 
  
   function CallPrompt() {
          
     var str = prompt("Введите строку:");  

      //Найти элемент с id="MyString" и вставить в него введенную строку. 
      document.getElementById("MyString").innerHTML = "Вы ввели строку:"+str;
   }
//---------------------------------------------------------------------------------------  
  

   //Функция вызова окна Confirm. 
  
   function CallConfirm() {
   
    var str="";       
     
     var val = confirm("Нажмите любую кнопку.");   
     
       if(val) str = "ok";
        else str = "Отмена";    

         //Найти элемент с id="MyString" и вставить в него введенную строку. 
         document.getElementById("MyString").innerHTML = "Вы нажали кнопку:"+str;   
   }
//---------------------------------------------------------------------------------------  
  