//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий: Работа с Cookies.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------


  //Обработчик кнопки "Создать Cookie для этой страницы".


  function CreateCookies(){

    //Создать Cookie с временем существования = 300сек.
    document.cookie = "JScookie=777; max-age=300";
  }
//--------------------------------------------------------------------------------------


  //Обработчик кнопки "Прочитать Cookie для этой страницы".


  function ReadCookies(){

    //Прочитать Cookie установленные для данной страницы.
    var cookies = document.cookie;

      //Найти элемент по id.
      var ParElem = document.getElementById("PrintCookies");

       //Отобразить прочитанные Cookies.
       ParElem.innerText = "Cookies for this page: "+cookies;
  }
//--------------------------------------------------------------------------------------
