//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий: Работа с Cookies.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------


  //Обработчик кнопки "Создать Cookie для этой страницы".


  function CreateCookies(){

    document.cookie = "JScookie=777; max-age=120";
  }
//--------------------------------------------------------------------------------------
