//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий: Создание, вставка и удаление HTML-элементов и  текстовых узлов.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------


   //Функция создания текстового параграфа и кнопки.
    
   function createTxtBtn() {
  
    var button, par, text, bdy;

      //Найти элемент(кнопку) с id="btn1".     
      button = document.getElementById("btn1");

        //Найти элемент body с id="elem_body".     
        bdy = document.getElementById("elem_body");
        
          //Создать новый элемент параграфа: <p> </p>
          par = document.createElement('p');
           
            //Вставить созданный параграф перед кнопкой.
            bdy.insertBefore(par, button);
             
             //Создать текстовый элемент.
             text =  document.createTextNode("Это текст внутри созданного HTML-элемента параграфа(<p> </p>).");

                //Вставить текстовый элемент в параграф.
                par.appendChild(text);

  }
 
//---------------------------------------------------------------------------------------