//---------------------------------------------------------------------------------------
//
// JavaScript-сценарии: Работа со стилями CSS.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------


   //Функция изменения цвета элемента.
    
   function changeColor(id) {
  
    var elem;

      //Найти элемент с id="btn1".     
      elem = document.getElementById(id);

        
   } 
//---------------------------------------------------------------------------------------
   
   
   