//---------------------------------------------------------------------------------------
//
// JavaScript-сценарии: Работа со стилями CSS.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------


   //Функция изменения ширины и цвета элемента.
    
   function changeColor(id) {
  
    var elem;

      //Найти элемент с заданным id.     
      elem = document.getElementById(id);

       //Изменить ширину элемента.
       elem.style.width = "500px";

        //Изменить цвет элемента.
        elem.style.backgroundColor = "#9100ff";  

          elem.innerHTML = " Изменена ширина и цвет элемента!!!"
   } 
//---------------------------------------------------------------------------------------
   
   
   