//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий: Чтение содержимого файлов.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------


 //Обработчик события открытия текстового файла по нажатию стандартной кнопки.
 //Отображает содержимое выбранного текстового файла.

 function ReadFile(file) {
 	
  alert("ReadFile");
 }
//--------------------------------------------------------------------------------------

 //Обработчик события открытия файла по нажатию стандартной кнопки. 
 //Определяет тип выбранного файла.

 function CheckFileType(file) {
  
   alert("CheckFileType");
 }
//--------------------------------------------------------------------------------------