//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий для работы с HTML-формами.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------

   //Функция определяющая выбранную радио-кнопку.
    
   function ShowCheckedRadio() {

     //Найти форму радио-кнопок.
     var form = document.getElementById("mf");

      //Найти параграф для отображения результата.
      var par = document.getElementById("inf");

      for(var i=0; i<form.elements.length; i++) {
        if(form.elements[i].checked) par.innerHTML = "Выбран режим "+(i+1);
      } 
   }
  //---------------------------------------------------------------------------------------

    