//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий:  Получение данных о местонахождениии.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------

 // Запустить функцию сразу после загрузки страницы.
  window.onload = PostConstruct;

 //--------------------------------------------------------------------------------------
   
   // Функция, запускающаяся сразу после загрузки страницы.
   // Обработчик события "window.onload".
   
   function PostConstruct(){

      
   }

 //--------------------------------------------------------------------------------------


  //Обработчик кнопки "Запросить данные о местонахождении".


  function GeoBtnHandler(){

    //Если объект "geolocation" не поддерживается.
    if (!navigator.geolocation) {
     alert("Объект \"geolocation\" не поддерживается.Определение местоположения невозможно.");
    }
    else {
          //Запросить данные о местонахождении и вызвать функцию "ProcessingFunction" сразу
          //после получения данных.
          navigator.geolocation.getCurrentPosition(ProcessingFunction);
    } 
  }
 //--------------------------------------------------------------------------------------

   //Функция, запускающаяся автоматически после получения данных о местонахождении.
   function ProcessingFunction(pos){

    //Сохранить координаты и точность этих координат.
    var latitude = pos.coords.latitude; 
    var longitude = pos.coords.longitude; 
    var accuracy = pos.coords.accuracy;

      alert("latitude = "+latitude+";  longitude = "+longitude+"; accuracy = "+accuracy);
   }
 //--------------------------------------------------------------------------------------
 