//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий для работы с библиотекой JQuery.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  
  // Запустить функцию сразу после загрузки страницы.
  window.onload = PostConstruct;

 //--------------------------------------------------------------------------------------
   
   // Функция, запускающаяся сразу после загрузки страницы.
   // Обработчик события "window.onload".
   
   function PostConstruct(){

     //Поочередный вывов функций, которые должны выполниться сразу после загрузки страницы. 
     Init();
   }

 //--------------------------------------------------------------------------------------


   //Функция . 
  
   function Init() {
   
    
    //Вызвать функцию, указанную в качестве параметра сразу после загрузки страницы.
    $(function(){alert("YES");});

     //var ret=$(function(){alert("YES");});
    //alert("INIT"); 
   }
//---------------------------------------------------------------------------------------

  
  