//------------------- --------------------------------------------------------------------
//
// JavaScript-сценарий который будет загружаться с моего репозитория на GitHub с помощью 
// AJAX-запросов библиотеки JQuery, после чего его функции станут доступны для выполнения.
// Загрузка сценария выполняется по нажатию кнопки на странице "jqeuery_ajax.html".
//
//--------------------------------------------------------------------------------------- 

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  

   // Функция, запускающаяся по нажатию кнопки "Загрузить сценарии" на странице "jqeuery_ajax.html".
   
   
   function CallAlert(){
    
    alert("Выполнен запуск функции 'CallAlert()' из загруженного файла сценария 'MyScriptLibrary.js'");  
   }
//---------------------------------------------------------------------------------------



