//------------------- --------------------------------------------------------------------
//
// JavaScript-сценарий который будет загружаться с помощью AJAX-запросов библиотеки JQuery
// и использоваться после загрузки.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  

   // Функция, запускающаяся сразу после загрузки страницы.
   
   
   function CallAlert(){
    
    alert("Выполнен запуск функции CallAlert() из загруженного сценария MyScriptLibrary.js");  
   }
//--------------------------------------------------------------------------------------



