//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий: Параллельный поток.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------

  //Обработчик события приема сообщений от основного потока.

  onmessage = function(e) {
  	                        //Прочитать сообщение. В нем содержится количество вычислений.
  	                        var num = e.data;

  	                         //Выполнить требуемое количество вычислений. 
  	                         var res = calculate(num);

                              //Отправить результат основному потоку.
  	                          postMessage(res); 
  	                      }
//--------------------------------------------------------------------------------------

 //Функция имитирующая выполнение длительных вычислений.

 function calculate(quantity) {
 	
   //Выполнение (quantity*quantity*quantity) итераций.
   for(var count = 0; count < quantity; count++) {
   
      for(var i = 0; i < quantity; i++) { 
      	 for(var j = 0; j < quantity; j++) { }
      }
   }

  return quantity;
 }
//--------------------------------------------------------------------------------------
 