//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий, поиск HTML-элементов.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  
 
   function search() {
   	
       //Найти все элементы <p>. 
       var elem = document.getElementsByTagName("p");
        
         //Заменить текст в найденных элементах.
         for(var i=0; i<elem.length; i++){
           elem[i].innerHTML = "Это абзац номер "+i+".";
         }
       
   }
 
 //---------------------------------------------------------------------------------------  

  function spanSearch() {
    
       //Найти параграф с id="par". 
       var parag = document.getElementById("par");

         //Найти все элементы <span> в пределах данного параграфа.
         var elem = parag.getElementsByTagName("span");
        
         //Заменить текст в найденных элементах <span>.
         for(var i=0; i<elem.length; i++){
           elem[i].innerHTML = "Замена "+i+".";
         }
       
   }
 
 //---------------------------------------------------------------------------------------  

 