//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий, поиск HTML-элементов.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  
    //Функция поиска HTML-элементов по имени тега.

   function search() {
   	
       //Найти все элементы <p>. 
       var elem = document.getElementsByTagName("p");
        
         //Заменить текст в найденных элементах.
         for(var i=0; i<elem.length; i++){
           elem[i].innerHTML = "Это абзац номер "+i+".";
         }
       
   }
 
 //---------------------------------------------------------------------------------------  

  //Функция поиска вложенных HTML-элементов по имени тега.

  function spanSearch() {
    
       //Найти параграф с id="par". 
       var parag = document.getElementById("par");

         //Найти все элементы <span> в пределах данного параграфа.
         var elem = parag.getElementsByTagName("span");
        
         //Заменить текст в найденных элементах <span>.
         for(var i=0; i<elem.length; i++){
           elem[i].innerHTML = "Замена "+i+".";
         }
       
   }
 
 //---------------------------------------------------------------------------------------

  //Функция поиска HTML-элементов по атрибуту "class".

  function classSearch() {
    
       //Найти параграф с id="par". 
       var parag = document.getElementById("par2");

         //Найти все элементы с атрибутом class="txt" в пределах данного параграфа.
         var elem = parag.getElementsByClassName("txt");
        
         //Заменить текст в найденных элементах.
         for(var i=0; i<elem.length; i++){
           elem[i].innerHTML = "Это замена текста "+i+".";
         }
       
   }
 
 //---------------------------------------------------------------------------------------    

  //Функция поиска HTML-элементов методом "querySelectorAllSearch".

  function SelectorAllSearch() {
    
    //Найти элементы с атрибутами class="edit", id="myline", и все дочерние элементы "span" внутри элемента с id="sp".
    var elem = document.querySelectorAll(".edit, #myline, #sp>span");
        
         //Заменить текст в найденных элементах.
         for(var i=0; i<elem.length; i++){
           elem[i].innerHTML = "Это замена текста "+i+".";
         }
       
   }
 
 //---------------------------------------------------------------------------------------    