//------------------- --------------------------------------------------------------------
//
// JavaScript-сценарий который будет загружаться с моего репозитория на GitHub с помощью 
// AJAX-запросов библиотеки JQuery и выполняться сразу после загрузки.
// Загрузка сценария выполняется по нажатию кнопки на странице "jqeuery_ajax.html".
//
//--------------------------------------------------------------------------------------- 

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------

 //Эта функция будет выполнена сразу после загрузки сценария.
 alert("Файл сценария 'test.js' был успешно загружен с репозитория GitHub и выполнен!!!");  

//--------------------------------------------------------------------------------------- 

