//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий, выполняющий обратный отсчет времени.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  
  //Глобальная переменная, с которой начинается обратный отсчет.
  var par=10; 

//---------------------------------------------------------------------------------------
   
   //Функция, которая будет запускаться с периодом 1 секунда.

   function toPage() {

   	 //Найти элемент с id="TimeLabel". 
     var elem = document.getElementById("tlab");
 
       //Вставить глобальную переменную в найденный элемент.
       elem.innerHTML = par;

       //Декремент глобальной переменной.
       par=par-1;
   }
 
//---------------------------------------------------------------------------------------

   function TimeDown() {
   	
   	var h, init = par; //Сохранить начальное значение глобальной переменной.
   	
   	  // Запускать функцию "toPage" с периодом 1000 млсек.
   	  h = setInterval(toPage, 1000);

      //Вызвать функцию "function()" через (init+1)*1000 млсек.
   	  setTimeout( 

   	  	          function(){clearInterval(h) },  //Остановить циклический запуск функции "toPage".
   	  	          (init+1)*1000);
   }
 
 //---------------------------------------------------------------------------------------  

   //Запустить функцию "TimeDown()" по завершению загрузки HTML-страницы.

   window.onload = TimeDown;
 //---------------------------------------------------------------------------------------
                         
