//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий, перемещение по дереву HTML-элементов.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------

  var elem = document;
     
    //Функция перемещения по дереву HTML-элементов.

   function TreeSearch() {
   	
     //elem = elem.firstChild;    

      alert(elem); 
   }
 
 //---------------------------------------------------------------------------------------  

  