//---------------------------------------------------------------------------------------
//
// JavaScript-сценарий, разбор URL-адреса.
//
//---------------------------------------------------------------------------------------

 "use strict" //Использовать строгий режим ECMAScript 5, если браузер поддерживает его.

//---------------------------------------------------------------------------------------
  
 
   function URL_analyse() {
   	
    //Найти элемент с id="TimeLabel". 
     var elem = document.getElementById("url");
      
       //Вставить URL-адрес текущей страницы в найденный элемент.
       elem.innerHTML = window.location;
   }
 
 //---------------------------------------------------------------------------------------  

   //Запустить функцию "URL_analyse()" по завершению загрузки HTML-страницы.

   window.onload = URL_analyse;
 //---------------------------------------------------------------------------------------
                         
